---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendData.HookBendRadius
source: html/2c5d5061-0db2-a2f1-44b5-6bfed651e4f4.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.HookBendRadius Property

The radius of the hook fillets in the Rebar shape.

## Syntax (C#)
```csharp
public double HookBendRadius { get; set; }
```

## Remarks
Inner radius, not centerline